app/views/rooms/_review.html.erb


		<% ( room.review_points.max - room.stars ).times do  %>
---
SELECT AVG("reviews"."points") AS avg_id FROM "reviews" WHERE "reviews"."room_id" = ?  [["room_id", 3]]