app/controllers/confirmations_controller.rb

  def show
    user = User.find_by(confirmation_token: params[:token])
---
SELECT "users".* FROM "users" WHERE "users"."confirmation_token" = 'd8hC99Pan1FpQxzwuoms3g' LIMIT 1