app/controllers/rooms_controller.rb

  def index
    @search_query = params[:q]

    rooms = Room.search(@search_query).page(params[:page]).per(PER_PAGE)
---
SELECT "rooms".* FROM "rooms" ORDER BY "rooms"."id" DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "rooms"

  def show
    room_model = Room.friendly.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @room = current_user.rooms.friendly.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 5], ["id", "3"]]

  def create
    @room = current_user.rooms.build(room_params)

    if @room.save
---
INSERT INTO "rooms" ("created_at", "description", "location", "slug", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update

    @room = current_user.rooms.friendly.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."id" = ? LIMIT 1  [["user_id", 5], ["id", "3"]]

  def destroy
    @room = current_user.rooms.friendly.find(params[:id])
    @room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]