app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "users" SET "full_name" = ?, "location" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["full_name", "Henrique Luiz Sousa 12"], ["location", "Campinas 12"], ["password", "12"], ["updated_at", Fri, 10 Jan 2014 00:13:40 UTC +00:00]]
---
	def update
		@user = User.find params[:id]
		if @user.update user_params

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]
---
	def show
		@user = User.find params[:id]

INSERT INTO "users" ("bio", "confirmation_token", "created_at", "email", "full_name", "location", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@user = User.new(user_params)
		if @user.save