app/controllers/rooms/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."room_id" = ? AND "reviews"."user_id" = 5 LIMIT 1  [["room_id", 1]]
UPDATE "reviews" SET "points" = ?, "updated_at" = ? WHERE "reviews"."id" = 2  [["points", 4], ["updated_at", Wed, 22 Jan 2014 00:45:26 BRST -02:00]]
UPDATE "rooms" SET "reviews_count" = COALESCE("reviews_count", 0) + 1 WHERE "rooms"."id" = 1
---
  def create
    review = room.reviews.find_or_initialize_by(user_id: current_user.id)
    review.update!(review_params)